{
    "rooms": [
        {
            "id": "abyss",
            "description": "\n\nYou have entered Joseph's mind, which is organized like a castle. \n\tYou have entered Joseph’s mind, which is organized like a castle.\n", 
            "look": "The abyss surrounds you. Before you is a looming fortress. The air is still and hums with a strange energy. You stand at the portcullis, which is lifted just enough to allow someone to slip inside.",
            "exits": [
                {
                    "name": [
                        "forward",
                        "north",
                        "castle",
                        "gate",
                        "fortress",
                        "portcullis"
                    ],
                    "room_id": "courtyard"
                }
            ]
        },
        {
            "id": "courtyard",
            "description": "The portcullis slams shut behind you! You stand in a courtyard. The front door of the castle towers above you.",
            "look": "You can reach the door handle, but there is also a doorbell.",
            "exits": [
                {
                    "name": [
                        "forward",
                        "north",
                        "castle",
                        "door",
                        "handle",
                        "door handle"
                    ],
                    "room_id": "entryhall"
                },
                {
                    "name": [
                        "doorbell",
                        "ring doorbell"
                    ],
                    "room_id": "doorbell"
                },
                {
                    "name": [
                        "back"
                    ],
                    "room_id": "abyss"
                }
            ]
        },
        {
            "id": "doorbell",
            "description": "The door swings open, revealing the great entry hall of the castle. A draft blows from within, carrying these words: \"Wow! You are so polite! Here is a compass to help you on your travels as a token of appreciation!\" A Compass falls from the above and into your hands",
            "look": "And you thought this would bea trap. Tsk Tsk Tsk",
            "exits": [
                {
                    "name": ["forward"],
                    "room_id": "entryhall"
                },
                {
                    "name": ["back"],
                    "room_id": "courtyard"
                }
            ]
        },
        {
            "id": "door",
            "description": "With enormous effort, you push open the heavy front door. You are greated by empty silence",
            "look": "I cannot tell you anything more about this room",
            "exits": [
                {
                    "name": [
                        "forward"
                    ],
                    "room_id": "entryhall"
                },
                {
                    "name": [
                        "back"
                    ],
                    "room_id": "courtyard"
                }
            ]
        },
        {
            "id": "entryhall",
            "description": "You stand in the Grand Entry Hall of the Castle. An extravagant stairway leads further into the castle.",
            "look": "The floor is covered by a lush blue rug. Four unique tapestries cover the walls, depicting scenes from various franchises. A grand chandelier hangs from the ceiling.",
            "exits": [
                {
                    "name": [
                        "forward",
                        "north",
                        "stairway"
                    ],
                    "room_id": "stairway"
                },
                {
                    "name": [
                        "back"
                    ],
                    "room_id": "courtyard"
                }
            ]
        }
    ],
    "start_room": "abyss"
}